Revit 2027 API
InitialWattageIntensity.Wattage Property
 The wattage value.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Wattage { get; set; }
Public Property Wattage As Double
	Get
	Set
public:
property double Wattage {
	double get ();
	void set (double value);
}
member Wattage : float with get, set
Property Value
Double
 The wattage value in W as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The wattage value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace